In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("data.csv")

In [3]:
df=pd.DataFrame(data)
df.head()

    name  rollno  admno college
0   Manu       1   1001   MBCET
1    Tom       2   1002   MBCET
2  Ardra       3   2001     CET
3  Kevin       3   1221     SCT
4  Kiran       1   2313     RIT

In [4]:
df.tail(n=2)

     name  rollno  admno college
4   Kiran       1   2313     RIT
5  Thomas       5   1009     CET

In [5]:
df.tail()

     name  rollno  admno college
1     Tom       2   1002   MBCET
2   Ardra       3   2001     CET
3   Kevin       3   1221     SCT
4   Kiran       1   2313     RIT
5  Thomas       5   1009     CET

In [6]:
df.describe()

         rollno        admno
count  6.000000     6.000000
mean   2.500000  1424.500000
std    1.516575   582.012972
min    1.000000  1001.000000
25%    1.250000  1003.750000
50%    2.500000  1115.000000
75%    3.000000  1806.000000
max    5.000000  2313.000000